OdDAI.ApplicationInstance.validateArrayNotOptional(OdArray&lt;OdDAI.Attribute**,OdObjectsAllocator&lt;OdDAI.Attribute**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether array instances whose array type declaration does not allow optional elements
have values at all index positions.
\param aggr [out] An array of pointers to Attribute instances for attributes which didn't pass the check.
\returns True if all instances of array items has not unset values, otherwise returns false ;

OdDAI.ApplicationInstance.validateExplicitAttrsReferences(OdArray&lt;OdDAI.Attribute**,OdObjectsAllocator&lt;OdDAI.Attribute**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether all of the entity instances that are values of attributes of the specified application
instance are of a valid entity data type for those attributes.
\param aggr [out] An array of pointers to Attribute instances for attributes which didn't pass the check.
\returns True if all entity-valued attributes have instance values of a correct type;
returns False if any entity-valued attribute has an instance value of an incorrect type;
returns Unknown if any required explicit attribute value is unset that could reference an entity instance;

OdDAI.ApplicationInstance.validateAggrUniqueness(OdArray&lt;OdDAI.Attribute**,OdObjectsAllocator&lt;OdDAI.Attribute**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether application instance aggregate attributes has unique items in the case if aggregation type of attribute UNIQUE flag is turned on.
\param aggr [out] An array of pointers to Attribute instances for attributes which didn't pass the aggregate uniqueness check.
\returns True if all appropriate attributes of application instance passed the check;
returns False if at least one attribute doesn't pass the check of uniqueness;

OdDAI.ApplicationInstance.validateBinaryWidth(OdArray&lt;OdDAI.Attribute**,OdObjectsAllocator&lt;OdDAI.Attribute**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the instance has binary attributes with incorrect width and retrieves the list of such attributes.
\param aggr [out] An array of pointers to Attribute instances which have incorrect width for the application instance.
\returns True if all attribute binary values are of correct width, false if width constraint is violated, and Unknown if expression
evaluation value is unknown or indeterminate.

OdDAI.ApplicationInstance.validateInverseAttrs(OdArray&lt;OdDAI.InverseAttribute**,OdObjectsAllocator&lt;OdDAI.InverseAttribute**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the instance has inverse attributes with violated size constraints and retrieves the list of such attributes.
\param aggr [out] An array of pointers to InverseAttribute instances which have violated size constraints for the application instance.
\returns
true if all inverse attributes constraints are satisfied or if the instance has no inverse attributes; otherwise, the method returns false.

OdDAI.ApplicationInstance.unsetAttrCaseInsensitive(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Checks whether the value of a specified attribute is set.
\param explicitAttrName [in] A null-terminated ANSI string that contains the attribute name.
\returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.ApplicationInstance.putAttrWithValidation(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value with validation of an attribute that is specified by its name.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\param val              [in] A new attribute value to be set.
\returns true if the attribute value was successfully set; otherwise, the method returns false.

OdDAI.ApplicationInstance.putAttr(OdSmartPtr&lt;OdDAI.ExplicitAttribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value of an attribute that is specified by its definition.
\param explicitAttr     [in] Pointer to the attribute definition.
\param val              [in] A new attribute value to be set.
\returns true if the attribute value was successfully set; otherwise, the method returns false.

OdDAI.ApplicationInstance.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param attrName [in] An ANSI string that contains the attribute name.
\returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).